Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDiscardedSplittersWarning Property
 Not all intersecting references (levels, reference planes or lines) could be used to intersect the surface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceDiscardedSplittersWarning { get; }
Public Shared ReadOnly Property DividedSurfaceDiscardedSplittersWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceDiscardedSplittersWarning {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceDiscardedSplittersWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace